//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// /*++
// Copyright (c) 2011-2016 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#

#include "Strings.uni"

//---------------------------------------------------------------------------
// FW Configuration definitions
//---------------------------------------------------------------------------
#string STR_AMT_FORM                                     #language en-US "Workstation ME Configuration"
#string STR_AMT_FORM_HELP                                #language en-US "Configure Workstation ME Technology Parameters"
#string STR_AMT_FORM_TITLE                               #language en-US "Workstation ME Configuration"
#string STR_AMT_FORM_SUBTITLE                            #language en-US "General ME Configuration"

#string STR_ME_FWVER_OPERATIONAL_PROMPT                  #language en-US "Oper. Firmware Version"
#string STR_ME_FWVER_OPERATIONAL_HELP                    #language en-US "Version of operational firmware selected to run."
#string STR_ME_FWVER_OPERATIONAL_VALUE                   #language en-US "N/A"
#string STR_ME_FWVER_BACKUP_PROMPT                       #language en-US "Backup Firmware Version"
#string STR_ME_FWVER_BACKUP_HELP                         #language en-US "Version of backup operational firmware if present (optional)."
#string STR_ME_FWVER_BACKUP_VALUE                        #language en-US "N/A"
#string STR_ME_FWVER_RECOVERY_PROMPT                     #language en-US "Recovery Firmware Version"
#string STR_ME_FWVER_RECOVERY_HELP                       #language en-US "Version of recovery firmware - runs when ME is in recovery mode."
#string STR_ME_FWVER_RECOVERY_VALUE                      #language en-US "N/A"

#string STR_ME_FWSTS1_HELP                               #language en-US "ME Firmware Status #1 register in HECI-1 configuration space."
#string STR_ME_FWSTS1_PROMPT                             #language en-US "ME Firmware Status #1"
#string STR_ME_FWSTS1_VALUE                              #language en-US "N/A"
#string STR_ME_FWSTS2_HELP                               #language en-US "ME Firmware Status #2 register in HECI-1 configuration space."
#string STR_ME_FWSTS2_PROMPT                             #language en-US "ME Firmware Status #2"
#string STR_ME_FWSTS2_VALUE                              #language en-US "N/A"
#string STR_ME_FWCURSTE_HELP                             #language en-US "ME firmware Current State, bits [3:0] in MEFS1."
#string STR_ME_FWCURSTE_PROMPT                           #language en-US "  Current State"
#string STR_ME_FWCURSTE_VALUE                            #language en-US "N/A"
#string STR_ME_FWERRCODE_HELP                            #language en-US "ME firmware Error Code, bits [15:12] in MEFS1."
#string STR_ME_FWERRCODE_PROMPT                          #language en-US "  Error Code"
#string STR_ME_FWERRCODE_VALUE                           #language en-US "N/A"

#string STR_ME_FW_TYPE_PROMPT                            #language en-US "ME Firmware Type"
#string STR_ME_FW_TYPE_HELP                              #language en-US "ME Firmware Type"   
#string STR_ME_FW_TYPE_VALUE                             #language en-US "N/A" //dynamically updated
#string STR_ME_FW_TYPE_HELP                              #language en-US "ME Firmware Type (Workstation/HEDT or SPS)"
#string STR_ME_FW_TYPE_SPS                               #language en-US "SPS"
#string STR_ME_FW_TYPE_AMT                               #language en-US "Workstation/HEDT"
#string STR_ME_FW_TYPE_UNKNOWN                           #language en-US "Unknown"
#string STR_ME_FW_SKU_HELP                               #language en-US "ME Firmware SKU"
#string STR_ME_FW_SKU_PROMPT                             #language en-US "ME Firmware SKU"
#string STR_ME_FW_SKU_VALUE                              #language en-US "N/A" //dynamically updated
#string STR_ME_FILE_SYSTEM_CORRUPTION_HELP               #language en-US "Me File System Integrity Value"
#string STR_ME_FILE_SYSTEM_CORRUPTION_PROMPT             #language en-US "Me File System Integrity Value"
#string STR_ME_FILE_SYSTEM_CORRUPTION_VALUE              #language en-US "N/A" //dynamically updated 

#string STR_ME_FW_INFO_HELP                              #language en-US  "Multiple SKU selection \nMiniSku:\n ME + MeClock \nFull SKU:\n ME + AMT(whole AMT)+ MeClock + DT\nAuto Selection:\n Which kind of Me Firmware is it at present"
#string STR_ME_FW_INFO_PROMPT                            #language en-US  "ME Firmware"
#string STR_ME_FW_INFO_VALUE                             #language en-US  "N/A" //dynamically updated
#string STR_ME_NORMAL_MODE                               #language en-US  "Normal Mode"
#string STR_ME_FAILED                                    #language en-US  "ME Failed"
#string STR_ME_TEMP_DISABLED                             #language en-US  "ME Temporarily Disabled"   
#string STR_ME_SECOVER                                   #language en-US  "Secovr Jmpr/Heci MSG"   
#string STR_ME_ALT_DISABLED                              #language en-US  "ME ALT Disabled"

#string STR_AMT_STATE_PROMPT                             #language en-US "Manageability App Enable"
#string STR_AMT_STATE_HELP                               #language en-US "Enable/Disable Manageability Application and other manageability features. \nThis option will send a en/dis state message to firmware to toggle the manageability feature states."

//---------------------------------------------------------------------------
// AMT Configuration definitions
//---------------------------------------------------------------------------
#string STR_AMT_CONFIG_FORM                              #language en-US "Manageability Application Configuration"
#string STR_AMT_CONFIG_FORM_HELP                         #language en-US "Configure Active Management Technology Parameters"
#string STR_AMT_CONFIG_FORM_TITLE                        #language en-US "Manageability Application Configuration"
#string STR_AMT_CONFIG_FORM_SUBTITLE                     #language en-US "AMT Configuration"

#string STR_FW_UPGRADE_SUBTITLE                          #language en-US "Firmware Update Configuration"
#string STR_FW_UPGRADE_SUBTITLE_HELP                     #language en-US "Configure Management Engine Technology Parameters"
#string STR_AMT_ME_FW_DOWNGRADE_PROMPT                   #language en-US "Me FW Image Re-Flash"
#string STR_AMT_ME_FW_DOWNGRADE_HELP                     #language en-US "Enable/Disable Me FW Image Re-Flash function."
#string STR_AMT_LOCAL_FW_UPDATE_PROMPT                   #language en-US "Local FW Update"
#string STR_AMT_LOCAL_FW_UPDATE_HELP                     #language en-US "Options for Local FW Update function."

#string STR_MNG_STATE_PROMPT                             #language en-US "Manageability State"
#string STR_MNG_STATE_HELP                               #language en-US "Enable/Disable Intel Manageability features including AMT, CIRA, CILA."
#string STR_MDES_PROMPT                                  #language en-US "MDES Capability"
#string STR_MDES_HELP                                    #language en-US "MDES Capability state control"

#string STR_AMTBX_HOTKEY_PRESSED_PROMPT                  #language en-US "BIOS Hotkey Pressed"
#string STR_AMTBX_HOTKEY_PRESSED_HELP                    #language en-US "OEMFLag Bit 1:\nEnable/Disable BIOS hotkey press."
#string STR_AMTBX_SELECTION_SCREEN_PROMPT                #language en-US "MEBx Selection Screen"
#string STR_AMTBX_SELECTION_SCREEN_HELP                  #language en-US "OEMFLag Bit 2:\nEnable/Disable MEBx selection screen."
#string STR_AMT_HIDE_CONFIRMATION_UNCONFIGURE_ME_PROMPT  #language en-US "Hide Un-Configure ME Confirmation Prompt"
#string STR_AMT_HIDE_CONFIRMATION_UNCONFIGURE_ME_HELP    #language en-US "OEMFlag Bit 6:\nHide Un-Configure ME without password Confirmation Prompt "
#string STR_AMT_MEBX_DEBUG_MSG_PROMPT                    #language en-US "MEBx Debug Message Output"
#string STR_AMT_MEBX_DEBUG_MSG_HELP                      #language en-US "OEMFlag Bit 14:\nEnable MEBx debug message output."
#string STR_AMT_UNCONFIGURE_ME_PROMPT                    #language en-US "Un-Configure ME"
#string STR_AMT_UNCONFIGURE_ME_HELP                      #language en-US "OEMFlag Bit 15:\nUn-Configure ME without password."

#string STR_AMT_CIRA_REQUEST_PROMPT                      #language en-US "Activate Remote Assistance Process"
#string STR_AMT_CIRA_REQUEST_HELP                        #language en-US "Trigger CIRA boot."
#string STR_AMT_USB_CONFIGURE_PROMPT                     #language en-US "USB Configure"
#string STR_AMT_USB_CONFIGURE_HELP                       #language en-US "Enable/Disable USB Configure function."
#string STR_AMT_PET_PROGRESS_PROMPT                      #language en-US "PET Progress"
#string STR_AMT_PET_PROGRESS_HELP                        #language en-US "User can Enable/Disable PET Events progress to recieve PET events or not."
#string STR_AMT_CIRA_TIMEOUT_PROMPT                      #language en-US "AMT CIRA Timeout"
#string STR_AMT_CIRA_TIMEOUT_HELP                        #language en-US "OEM defined timeout for MPS connection to be established.\n  0 - use the default timeout value of 60 seconds. \n  255 - MEBX waits until the connection succeeds"

//---------------------------------------------------------------------------
// SMM Definitions
//---------------------------------------------------------------------------
#string STR_FW_SMBIOS_MENU_TITLE                         #language en-US  "SMBIOS type 130 OEM capabilities"
#string STR_FW_SMBIOS_MENU_HELP                          #language en-US  "This menu allows changing SMBIOS type 130 OEM capabilities"
#string STR_FW_SMBIOS_REFLASH_PROMPT                     #language en-US  "BIOS Reflash Capability State"
#string STR_FW_SMBIOS_REFLASH_HELP                       #language en-US  "Change BIOS Reflash Capability State"
#string STR_FW_SMBIOS_SETUP_PROMPT                       #language en-US  "BIOS Boot to Setup Capability State"
#string STR_FW_SMBIOS_SETUP_HELP                         #language en-US  "Change BIOS Boot to Setup Capability State"
#string STR_FW_SMBIOS_PAUSE_PROMPT                       #language en-US  "BIOS Pause Before Booting Capability State"
#string STR_FW_SMBIOS_PAUSE_HELP                         #language en-US  "Change BIOS Pause Before Booting Capability State"
#string STR_FW_SMBIOS_SECURE_BOOT_PROMPT                 #language en-US  "BIOS Secure Boot Capability Exposure to FW State"
#string STR_FW_SMBIOS_SECURE_BOOT_HELP                   #language en-US  "Change BIOS Secure Capability Exposure State to FW. This does not affect SecureBoot as such"

//---------------------------------------------------------------------------
// Core Bios Done Message Definitions
//---------------------------------------------------------------------------
#string STR_ME_CORE_BIOS_DONE_PROMPT                     #language en-US  "Core Bios Done Message"
#string STR_ME_CORE_BIOS_DONE_HELP                       #language en-US  "Enable/Disable Core Bios Done message sent to ME"

//---------------------------------------------------------------------------
// ME State control definitions
//---------------------------------------------------------------------------
#string STR_ME_STATE_CONTROL_PROMPT                      #language en-US "  ME State"
#string STR_ME_STATE_CONTROL_HELP                        #language en-US "Change ME State. Heci1 needs to be set to enabled. Note **OEM** This is only a debug hook."

//---------------------------------------------------------------------------
// ASF Configuration
//---------------------------------------------------------------------------
#string STR_ASF_PROMPT                                   #language en-US "ASF"
#string STR_ASF_HELP                                     #language en-US "Enable/Disable Alert Specification Format."
#string STR_WATCHDOG_PROMPT                              #language en-US "WatchDog"
#string STR_WATCHDOG_HELP                                #language en-US "Enable/Disable WatchDog Timer."
#string STR_WATCHDOG_OS_PROMPT                           #language en-US "OS WatchDog"
#string STR_WATCHDOG_OS_HELP                             #language en-US "Enable/Disable watchdog at OS launch."

#string STR_WATCHDOG_TIMER_OS_PROMPT                     #language en-US " OS Timer"
#string STR_WATCHDOG_TIMER_OS_HELP                       #language en-US "Set OS watchdog timer."
#string STR_WATCHDOG_TIMER_BIOS_PROMPT                   #language en-US " BIOS Timer"
#string STR_WATCHDOG_TIMER_BIOS_HELP                     #language en-US "Set BIOS watchdog timer."

//---------------------------------------------------------------------------
// MEBx Resolution Configuration
//---------------------------------------------------------------------------
#string STR_MEBX_FORM                                    #language en-US "MEBx Resolution Settings"
#string STR_MEBX_FORM_HELP                               #language en-US "Resolution settings for MEBx graphics mode and UI/non-UI text mode"

#string STR_MEBX_SUBTITLE                                #language en-US "Set MEBx resolutions"

#string STR_MEBX_NONUI_MODE_PROMPT                       #language en-US "Non-UI Mode Resolution"
#string STR_MEBX_NONUI_MODE_HELP                         #language en-US "Resolution for non-UI text mode"

#string STR_MEBX_UI_MODE_PROMPT                          #language en-US "UI Mode Resolution"
#string STR_MEBX_UI_MODE_HELP                            #language en-US "Resolution for UI text mode"

#string STR_MEBX_GRAPHICS_MODE_PROMPT                    #language en-US "Graphics Mode Resolution"
#string STR_MEBX_GRAPHICS_MODE_HELP                      #language en-US "Resolution for graphics mode"

#string STR_MEBX_MODE_AUTO                               #language en-US "Auto"
#string STR_MEBX_TEXT_80_25                              #language en-US "80x25"
#string STR_MEBX_TEXT_100_31                             #language en-US "100x31"

#string STR_MEBX_GRAPHICS_640_480                        #language en-US "640x480"
#string STR_MEBX_GRAPHICS_800_600                        #language en-US "800x600"
#string STR_MEBX_GRAPHICS_1024_768                       #language en-US "1024x768"

//---------------------------------------------------------------------------
// FW Debug Configuration definitions
//---------------------------------------------------------------------------

#if ME_TESTMENU_FLAG

#string STR_FWDEBUG_FORM                                 #language en-US "Workstation ME Debug Configuration"
#string STR_FWDEBUG_FORM_HELP                            #language en-US "Workstation ME firmware debug parameters configuration"
#string STR_FWDEBUG_FORM_TITLE                           #language en-US "Workstation ME Debug Configuration"

#string STR_FWDEBUG_GEN_FORM                             #language en-US "Workstation ME General Configuration"
#string STR_FWDEBUG_GEN_FORM_HELP                        #language en-US "Workstation ME basic features configuration"
#string STR_FWDEBUG_GEN_FORM_TITLE                       #language en-US "Workstation ME General Configuration"


#string STR_ME_ICC_OVERRIDE_FORM                         #language en-US "Override ICC Clock Settings"
#string STR_ME_ICC_OVERRIDE_FORM_HELP                    #language en-US "Override the default ICC Set Clock Settings."
#string STR_ME_ICC_OVERRIDE_FORM_TITLE                   #language en-US "Override ICC Clock Settings"

#string STR_ME_ICC_OVERRIDE_PROMPT                       #language en-US "Override ICC Clock Settings"
#string STR_ME_ICC_OVERRIDE_HELP                         #language en-US "This option allows customization of clock settings."


#string STR_ME_TIMEOUT_PROMPT                            #language en-US "ME Initialization Complete Timeout"
#string STR_ME_TIMEOUT_HELP                              #language en-US "This option defines how long BIOS waits for ME to initialize."

#string STR_ME_HSIO_ENABLE_PROMPT                        #language en-US  "Enable HSIO Messaging"
#string STR_ME_HSIO_ENABLE_HELP                          #language en-US  "Enable/Disable HSIO messaging"

#string STR_ME_DID_ENABLE_PROMPT                         #language en-US  "DRAM Init Done Enable"
#string STR_ME_DID_ENABLE_HELP                           #language en-US  "Enable/Disable notifying ME about DRAM initialization. (It Enables/Disables UMA functionality.)"

#string STR_ME_DID_INIT_STAT_PROMPT                      #language en-US  "  DRAM Initialization Status"
#string STR_ME_DID_INIT_STAT_HELP                        #language en-US  "Override the DRAM initialization status value."
#string STR_ME_DID_INIT_STAT_AUTO                        #language en-US  "Auto - true status"
#string STR_ME_DID_INIT_STAT_0                           #language en-US  "0 - Success"
#string STR_ME_DID_INIT_STAT_1                           #language en-US  "1 - No Memory in Channels"
#string STR_ME_DID_INIT_STAT_2                           #language en-US  "2 - Memory Init Error"

#string STR_ME_GRLOCK_PROMPT                             #language en-US "Global Reset Lock"
#string STR_ME_GRLOCK_HELP                               #language en-US "Enable/Disable locking the joint ME and host reset capability"

#string STR_ME_GRPROMOTION_PROMPT                        #language en-US "CF9 global reset promotion"
#string STR_ME_GRPROMOTION_HELP                          #language en-US "Enable/Disable promoting CF9 reset to global"

#string STR_ME_HMRFPOLOCK_PROMPT                         #language en-US "HMRFPO_LOCK Message"
#string STR_ME_HMRFPOLOCK_HELP                           #language en-US "Enable/Disable sending HMRFPO_LOCK message to ME"

#string STR_ME_HMRFPOENABLE_PROMPT                       #language en-US "HMRFPO_ENABLE Message"
#string STR_ME_HMRFPOENABLE_HELP                         #language en-US "Enable/Disable sending HMRFPO_ENABLE message to ME"

#string STR_ME_ENDOFPOST_PROMPT                          #language en-US  "END_OF_POST Message"
#string STR_ME_ENDOFPOST_HELP                            #language en-US  "Enable/Disable sending END_OF_POST message to ME"

#string STR_ME_HRW_ENABLE_PROMPT                         #language en-US  "Host Reset Warning"
#string STR_ME_HRW_ENABLE_HELP                           #language en-US  "Enable/Disable sending Host Reset Warning to ME"

#string STR_ME_HECI1ENABLE_PROMPT                        #language en-US "HECI-1 Enable"
#string STR_ME_HECI1ENABLE_HELP                          #language en-US "Override HECI-1 status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_HECI2ENABLE_PROMPT                        #language en-US "HECI-2 Enable"
#string STR_ME_HECI2ENABLE_HELP                          #language en-US "Override HECI-2 status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_HECI3ENABLE_PROMPT                        #language en-US "HECI-3 Enable"
#string STR_ME_HECI3ENABLE_HELP                          #language en-US "Override HECI-3 status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_IDERENABLE_PROMPT                         #language en-US "IDEr Enable"
#string STR_ME_IDERENABLE_HELP                           #language en-US "Override IDEr status on PCI, or let firmware decide based on ME type (auto)"
#string STR_ME_KTENABLE_PROMPT                           #language en-US "KT Enable"
#string STR_ME_KTENABLE_HELP                             #language en-US "Override KT status on PCI, or let firmware decide based on ME type (auto)"

#string STR_ME_HECI1HIDEINME_PROMPT                      #language en-US "HECI-1 Hide in ME"
#string STR_ME_HECI1HIDEINME_HELP                        #language en-US "Enables sending request to ME to hide or disable HECI-1 on host PCI"
#string STR_ME_HECI2HIDEINME_PROMPT                      #language en-US "HECI-2 Hide in ME"
#string STR_ME_HECI2HIDEINME_HELP                        #language en-US "Enables sending request to ME to hide or disable HECI-2 on host PCI"
#string STR_ME_HECI3HIDEINME_PROMPT                      #language en-US "HECI-3 Hide in ME"
#string STR_ME_HECI3HIDEINME_HELP                        #language en-US "Enables sending request to ME to hide or disable HECI-3 on host PCI"

#string STR_D0I3_SETTING_DISABLE_PROMPT                  #language en-US  "D0I3 Setting for HECI Disable"
#string STR_D0I3_SETTING_DISABLE_HELP                    #language en-US  "Setting this option disables setting D0I3 bit for all HECI devices"

#endif // ME_TESTMENU_FLAG